Revit 2026 API

# ReferenceArrayArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferenceArrayArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
ReferenceArrayArrayIterator()
```
```fsharp
new : unit -> ReferenceArrayArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ReferenceArrayArrayIterator Class

Autodesk.Revit.DB Namespace